<?php

return [

    'cheatsheet' => '
<p>مارک‌دان سینتکسی برای کسانی است که دوست دارند راحت‌تر در وب محتوا ایجاد کنند. مارک‌دان این قابلیت را دارد که از سینتکسی ساده کدهای اچ‌تی‌ام‌ال معتبر بسازد. نوشتن با مارک‌دان روان و راحت است و در عین حال خواندن متون مارک‌دان هم هیچ سختی خاصی ندارد.</p>

<h3>سربرگ‌ها</h3>
<pre class="language-markdown"><code># این یک سربرگ اول است
## این سربرگ سطح دو
### این سربرگ سطح ۳ می‌باشد و دیگر سربرگ‌ها هم الگوی مشابه دارند.
</code></pre>

<h3>ضخیم و کج</h3>
<pre class="language-markdown"><code>شما می‌توانید متون را به *موکد*، **ضخیم**، یا _**هردو**_ تبدیل کنید.</code></pre>

<h3>پیوند</h3>
<pre class="language-markdown"><code>این یک [پیوند](http://example.com) می‌باشد.</code></pre>

<h3>کد</h3>
<p>
با محصور کردن کد در سه عدد بکتیک در ابتدا و انتهای کد (<code>```</code>) می‌توانید خروجی مناسب کد داشته باشید.
</p>

<pre class="language-markdown"><code>```
this: is some yaml
```</code></pre>

<p>همچنین می‌توانید با محصور کردن کد خود داخل فقط یک جفت بکتیک <code>`</code> کدهای درون خطی بنویسید.

<h3>نقل قول</h3>

<p>اگر خط را با <code>> </code> شروع کنید آن خط تبدیل به یک بلوک نقل قول می‌شود.</p>

<pre class="language-markdown"><code>> این یک نقل قول خواهد بود.</code></pre>

<h3>تصاویر</h3>
<pre class="language-markdown"><code>![متن جایگزین تصویر](http://example.com/image.jpg)</code></pre>

<h3>لیست غیرشمارشی</h3>
<pre class="language-markdown"><code>- ساندویچ بیکن
- استیک
- نوشابه</code></pre>

<h3>لیست شمارشی</h3>
<pre class="language-markdown"><code>1. خوردن
2. نوشیدن
3. شاکر بودن</code></pre>

<h3>جدول</h3>

<pre class="language-markdown"><code>ستون اول  | ستون دوم
------------- | -------------
خانه‌ی جدول  | خانه‌ی جدول
خانه‌ی جدول  | خانه‌ی جدول</code></pre>',

];
