<?php

return [

    'cheatsheet' => '
<p>Markdown - это синтаксис разметки текста в HTML для веб-писателей. Markdown позволяет вам писать, используя удобный для чтения и написания формат обычного текста, который преобразуется в структурно допустимый HTML.</p>

<h3>Заголовки</h3>
<pre class="language-markdown"><code># Это заголовок h1
## Это заголовок h2
### Это заголовок h3, и так далее.
</code></pre>

<h3>Жирный текст и курсив</h3>
<pre class="language-markdown"><code>Слова можно *подчёркивать*, выделять **жирным шрифтом** или _**делать и то, и другое сразу**_.</code></pre>

<h3>Ссылки</h3>
<pre class="language-markdown"><code>Это [ссылка-пример](http://example.com).</code></pre>

<h3>Код</h3>
<p>
Оберните свой код тремя обратными знаками (<code>```</code>) до и после содержимого.
</p>

<pre class="language-markdown"><code>```
это некоторый yaml
```</code></pre>

<p>Вы также можете добавить код в строку, обернув содержимое одинарными обратными знаками <code>`</code>.

<h3>Цитирование</h3>

<p>Создайте блочную цитату, начав текст со слова <code>> </code>.</p>

<pre class="language-markdown"><code>> Это будет блочная цитата.</code></pre>

<h3>Изображения</h3>
<pre class="language-markdown"><code>![текст alt](https://picsum.photos/seed/'.time().'/200/300)</code></pre>

<h3>Неупорядоченный список</h3>
<pre class="language-markdown"><code>- Бекон
- Стейк
- Пиво</code></pre>

<h3>Упорядоченный список</h3>
<pre class="language-markdown"><code>1. Покушать
2. Попить
3. Повеселиться</code></pre>

<h3>Таблицы</h3>

<pre class="language-markdown"><code>Первый заголовок  | Второй заголовок
------------- | -------------
Ячейка содержимого  | Ячейка содержимого
Ячейка содержимого  | Ячейка содержимого</code></pre>',

];
