<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Validation Language Lines
    |--------------------------------------------------------------------------
    |
    | Наступні рядки містять стандартні повідомлення про помилки, що використовуються
    | класом валідатора. Деякі з цих правил мають кілька версій,
    | наприклад, правила для розмірів. Ви можете налаштовувати кожне з цих повідомлень тут.
    |
    */

    'accepted' => 'Повинно бути прийнято.',
    'accepted_if' => 'Повинно бути прийнято, коли :other дорівнює :value.',
    'active_url' => 'Це недійсна URL-адреса.',
    'after' => 'Повинно бути датою після :date.',
    'after_or_equal' => 'Повинно бути датою після або дорівнювати :date.',
    'alpha' => 'Може містити лише літери.',
    'alpha_dash' => 'Може містити лише літери, цифри, дефіси та підкреслення.',
    'alpha_num' => 'Може містити лише літери та цифри.',
    'array' => 'Повинно бути масивом.',
    'ascii' => 'Може містити лише однобайтні алфавітно-цифрові символи та символи.',
    'before' => 'Повинно бути датою до :date.',
    'before_or_equal' => 'Повинно бути датою до або дорівнювати :date.',
    'between' => [
        'array' => 'Повинно містити від :min до :max елементів.',
        'file' => 'Розмір повинен бути між :min та :max кілобайтами.',
        'numeric' => 'Значення повинно бути між :min та :max.',
        'string' => 'Кількість символів повинна бути між :min та :max.',
    ],
    'boolean' => 'Повинно бути true або false.',
    'can' => 'Містить неавторизоване значення.',
    'confirmed' => 'Підтвердження не збігається.',
    'current_password' => 'Пароль невірний.',
    'date' => 'Недійсна дата.',
    'date_equals' => 'Повинно бути датою, що дорівнює :date.',
    'date_format' => 'Не відповідає формату :format.',
    'decimal' => 'Повинно мати :decimal десяткових знаків.',
    'declined' => 'Повинно бути відхилено.',
    'declined_if' => 'Повинно бути відхилено, коли :other дорівнює :value.',
    'different' => 'Це поле та :other повинні бути різними.',
    'digits' => 'Повинно бути :digits цифрами.',
    'digits_between' => 'Повинно бути між :min та :max цифрами.',
    'dimensions' => 'Недійсні розміри зображення.',
    'distinct' => 'Це поле має дублікат значення.',
    'doesnt_end_with' => 'Не повинно закінчуватися одним із наступних: :values.',

    'doesnt_start_with' => 'Не повинно починатися з одного з наступних: :values.',
    'email' => 'Повинно бути дійсною електронною адресою.',
    'ends_with' => 'Повинно закінчуватися на :values',
    'enum' => 'Вибране :attribute недійсне.',
    'exists' => 'Вибране значення недійсне.',
    'file' => 'Повинно бути файлом.',
    'filled' => 'Повинно мати значення.',
    'gt' => [
        'array' => 'Повинно містити більше ніж :value елементів.',
        'file' => 'Повинно бути більше ніж :value кілобайтів.',
        'numeric' => 'Повинно бути більше ніж :value.',
        'string' => 'Повинно бути більше ніж :value символів.',
    ],
    'gte' => [
        'array' => 'Повинно містити :value елементів або більше.',
        'file' => 'Повинно бути більше або дорівнювати :value кілобайтів.',
        'numeric' => 'Повинно бути більше або дорівнювати :value.',
        'string' => 'Повинно бути більше або дорівнювати :value символів.',
    ],
    'image' => 'Повинно бути зображенням.',
    'in' => 'Вибране значення недійсне.',
    'in_array' => 'Це поле не існує в :other.',
    'integer' => 'Повинно бути цілим числом.',
    'ip' => 'Повинно бути дійсною IP-адресою.',
    'ipv4' => 'Повинно бути дійсною IPv4 адресою.',
    'ipv6' => 'Повинно бути дійсною IPv6 адресою.',
    'json' => 'Повинно бути дійсним JSON рядком.',
    'lowercase' => 'Повинно бути в нижньому регістрі.',
    'lt' => [
        'array' => 'Повинно містити менше ніж :value елементів.',
        'file' => 'Повинно бути менше ніж :value кілобайтів.',
        'numeric' => 'Повинно бути менше ніж :value.',
        'string' => 'Повинно бути менше ніж :value символів.',
    ],
    'lte' => [
        'array' => 'Не повинно містити більше ніж :value елементів.',
        'file' => 'Повинно бути менше або дорівнювати :value кілобайтів.',
        'numeric' => 'Повинно бути менше або дорівнювати :value.',
        'string' => 'Повинно бути менше або дорівнювати :value символів.',
    ],
    'mac_address' => 'Повинно бути дійсною MAC-адресою.',
    'max' => [
        'numeric' => 'Не може бути більше ніж :max.',
        'file' => 'Не може бути більше ніж :max кілобайтів.',
        'string' => 'Не може бути більше ніж :max символів.',
        'array' => 'Не може містити більше ніж :max елементів.',

    ],
    'max_digits' => 'Не може мати більше ніж :max цифр.',
    'mimes' => 'Повинно бути файлом типу: :values.',
    'mimetypes' => 'Повинно бути файлом типу: :values.',
    'min' => [
        'numeric' => 'Повинно бути принаймні :min.',
        'file' => 'Повинно бути принаймні :min кілобайтів.',
        'string' => 'Повинно бути принаймні :min символів.',
        'array' => 'Повинно містити принаймні :min елементів.',
    ],
    'min_digits' => 'Повинно мати принаймні :min цифр.',
    'missing' => 'Повинно бути відсутнім.',
    'missing_if' => 'Повинно бути відсутнім, коли :other дорівнює :value.',
    'missing_unless' => 'Повинно бути відсутнім, якщо :other знаходиться в :values.',
    'missing_with' => 'Повинно бути відсутнім, коли присутні :values.',
    'missing_with_all' => 'Повинно бути відсутнім, коли присутні всі :values.',
    'multiple_of' => 'Повинно бути кратним :value.',
    'not_in' => 'Вибране значення недійсне.',
    'not_regex' => 'Формат недійсний.',
    'numeric' => 'Повинно бути числом.',
    'present' => 'Повинно бути присутнім.',
    'prohibited' => 'Заборонено.',
    'prohibited_if' => 'Заборонено, коли :other дорівнює :value.',
    'prohibited_unless' => 'Заборонено, якщо :other не знаходиться в :values.',
    'prohibits' => 'Забороняє присутність :other.',
    'regex' => 'Формат недійсний.',
    'required' => 'Це поле обов\'язкове для заповнення.',
    'required_array_keys' => 'Має містити записи для: :values.',
    'required_if' => 'Це поле обов\'язкове, коли :other дорівнює :value.',
    'required_if_accepted' => 'Це поле обов\'язкове, коли :other прийнято.',
    'required_unless' => 'Це поле обов\'язкове, якщо :other не знаходиться в :values.',
    'required_with' => 'Це поле обов\'язкове, коли :values присутній.',
    'required_with_all' => 'Це поле обов\'язкове, коли всі :values присутні.',
    'required_without' => 'Це поле обов\'язкове, коли :values відсутній.',
    'required_without_all' => 'Це поле обов\'язкове, коли жоден з :values не присутній.',
    'same' => 'Це поле та :other повинні збігатися.',
    'size' => [
        'array' => 'Повинно містити :size елементів.',
        'file' => 'Повинно бути :size кілобайтів.',
        'numeric' => 'Повинно бути :size.',
        'string' => 'Повинно бути :size символів.',
    ],
    'starts_with' => 'Повинно починатися з одного з наступних: :values',
    'string' => 'Повинно бути рядком.',

    'timezone' => 'Повинно бути дійсною зоною.',
    'unique' => 'Це значення вже було використано.',
    'uploaded' => 'Не вдалося завантажити.',
    'uppercase' => 'Повинно бути в верхньому регістрі.',
    'url' => 'Формат недійсний.',
    'ulid' => 'Повинно бути дійсним ULID.',
    'uuid' => 'Повинно бути дійсним UUID.',

    /*
    |--------------------------------------------------------------------------
    | Custom Statamic Validation Language Lines
    |--------------------------------------------------------------------------
    |
    | Тут ви можете вказати повідомлення для валідації для специфічних правил, наданих Statamic.
    |
    */

    'unique_entry_value' => 'Це значення вже було використано.',
    'unique_term_value' => 'Це значення вже було використано.',
    'unique_user_value' => 'Це значення вже було використано.',
    'unique_form_handle' => 'Це значення вже було використано.',
    'duplicate_field_handle' => 'Поле з ідентифікатором :handle не може бути використане більше одного разу.',
    'one_site_without_origin' => 'Хоча б один сайт має бути без походження.',
    'origin_cannot_be_disabled' => 'Не можна вибрати вимкнене походження.',
    'unique_uri' => 'Цей URI вже був використаний.',
    'duplicate_uri' => 'Дублікат URI :value',
    'reserved' => 'Це зарезервоване слово.',
    'reserved_field_handle' => 'Поле з ідентифікатором :handle є зарезервованим словом.',
    'duplicate_field_handle' => 'Поле з ідентифікатором :handle вже існує.',
    'parent_causes_root_children' => 'Це призведе до того, що коренева сторінка матиме дочірні елементи.',
    'parent_cannot_be_itself' => 'Не може бути власним батьком.',
    'time' => 'Недійсний час.',
    'date_fieldtype_date_required' => 'Дата обов\'язкова.',
    'date_fieldtype_time_required' => 'Час обов\'язковий.',
    'date_fieldtype_start_date_required' => 'Початкова дата обов\'язкова.',
    'date_fieldtype_start_date_invalid' => 'Недійсна початкова дата.',
    'date_fieldtype_end_date_required' => 'Кінцева дата обов\'язкова.',
    'date_fieldtype_end_date_invalid' => 'Недійсна кінцева дата.',
    'date_fieldtype_only_single_mode_allowed' => 'Можна використовувати лише режим "Одиничний", коли ідентифікатор поля - дата.',
    'code_fieldtype_rulers' => 'Це недійсне значення.',
    'options_require_keys' => 'Усі опції мають мати ключі.',

    /*
    |--------------------------------------------------------------------------
    | Custom Validation Language Lines
    |--------------------------------------------------------------------------
    |
    | Тут ви можете вказати власні повідомлення валідації для атрибутів,
    | використовуючи конвенцію "attribute.rule" для назви рядків. Це дозволяє швидко
    | вказати конкретне власне повідомлення мовою для даного правила атрибута.
    |
    */

    'custom' => [
        'attribute-name' => [
            'rule-name' => 'власне-повідомлення',
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | Custom Validation Attributes
    |--------------------------------------------------------------------------
    |
    | Наступні рядки мови використовуються для заміни заповнювачів атрибутів
    | на щось більш зрозуміле для читача, таке як E-Mail Address замість
    | "email". Це просто допомагає нам робити повідомлення трохи чистішими.
    |
    */

    'attributes' => [],

];
